In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'c1':[34,45,34],'c2': ['a','b','c'],'c3':[1,2,3]})
df

   c1 c2  c3
0  34  a   1
1  45  b   2
2  34  c   3

In [5]:
df.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
df['c3'].sum()

6

In [8]:
def power3(x):
    return x**3

In [9]:
df['c3'].apply(power3)

0     1
1     8
2    27
Name: c3, dtype: int64

In [10]:
df['c1'].value_counts()

34    2
45    1
Name: c1, dtype: int64

In [11]:
df['c1'].unique()

array([34, 45], dtype=int64)

In [17]:
df['c1'].nunique()

3

In [13]:
df.sort_values(by = 'c1')

   c1 c2  c3
0  34  a   1
2  34  c   3
1  45  b   2

In [15]:
df = pd.DataFrame({'c1':[34,45,34,49],'c2': ['a','b','c',np.nan],'c3':[1,np.nan,2,3]})
df

   c1   c2   c3
0  34    a  1.0
1  45    b  NaN
2  34    c  2.0
3  49  NaN  3.0

In [16]:
df.isnull()

      c1     c2     c3
0  False  False  False
1  False  False   True
2  False  False  False
3  False   True  False

In [18]:
df.dropna()

   c1 c2   c3
0  34  a  1.0
2  34  c  2.0

In [19]:
df.fillna('hi')

   c1  c2   c3
0  34   a  1.0
1  45   b   hi
2  34   c  2.0
3  49  hi  3.0